tap "argoproj/tap"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "weaveworks/tap"

brew "bash"
brew "cowsay"
brew "gcc"
brew "gh"
brew "github-keygen"
brew "gnupg"
brew "helm"
brew "jq"
brew "k9s"
brew "llvm"
brew "mas"
brew "maven"
brew "sbt"
brew "stow"
brew "watch"
brew "yq"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "weaveworks/tap/eksctl"

brew "autoconf"
brew "automake"
brew "bash-completion"
brew "openssl@3"
brew "black"
brew "python@3.12"
brew "glib"
brew "cmake"
brew "coreutils"
brew "unbound"
brew "libksba"
brew "harfbuzz"
brew "icu4c@76"
brew "libpq"
brew "libtiff"
brew "libtool"
brew "libyaml"
brew "openjdk"
brew "openssl@1.1"
brew "pinentry-mac"
brew "pkg-config"
brew "postgresql@14"
brew "python@3.10"
brew "rust"
brew "zlib"
brew "hashicorp/tap/terraform"

mas "1Password 7", id: 1333542190
mas "Apple Configurator", id: 1037126344
mas "Classroom", id: 1358883623
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iStat Menus", id: 1319778037
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835

vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "atlassian.atlascode"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
